# SetRuleEnabled Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PerformanceAdviser..::..SetRuleEnabled Method
PerformanceAdviser Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SetRuleEnabled(Int32, Boolean) | Retrieves an enabled/disabled status for the given rule. |
| SetRuleEnabled(PerformanceAdviserRuleId, Boolean) | Retrieves an enabled/disabled status for the given rule. |

# See Also
PerformanceAdviser Class
PerformanceAdviser Members
Autodesk.Revit.DB Namespace